Terraform diff of the CLI above and main.tf file.
```hcl
  # google_cloud_run_service.tavern is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "tavern" {
      ~ id                         = "locations/us-central1/namespaces/ccdc-red-team-infra/services/tavern" -> (known after apply)
        name                       = "tavern"
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "tavern-00001-fej"
              - latest_ready_revision_name   = "tavern-00001-fej"
              - observed_generation          = 1
              - traffic                      = [
                  - {
                      - latest_revision = true
                      - percent         = 100
                      - revision_name   = "tavern-00001-fej"
                      - tag             = ""
                      - url             = ""
                    },
                ]
              - url                          = "https://tavern-rtqmb25lsq-uc.a.run.app"
            },
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      - metadata {
          - annotations           = {} -> null
          - effective_annotations = {
              - "client.knative.dev/user-image"     = "docker.io/spellshift/tavern:latest"
              - "run.googleapis.com/client-name"    = "gcloud"
              - "run.googleapis.com/client-version" = "410.0.0"
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "0f58abca-923b-42d4-822a-3e74a4e4e8af"
              - "run.googleapis.com/urls"           = jsonencode(
                    [
                      - "https://tavern-3836239296.us-central1.run.app",
                      - "https://tavern-rtqmb25lsq-uc.a.run.app",
                    ]
                )
              - "serving.knative.dev/creator"       = "hulto@hul.to"
              - "serving.knative.dev/lastModifier"  = "hulto@hul.to"
            } -> null
          - effective_labels      = {
              - "cloud.googleapis.com/location" = "us-central1"
            } -> null
          - generation            = 1 -> null
          - labels                = {} -> null
          - namespace             = "ccdc-red-team-infra" -> null
          - resource_version      = "AAYlZn/0boQ" -> null
          - self_link             = "/apis/serving.knative.dev/v1/namespaces/3836239296/services/tavern" -> null
          - terraform_labels      = {} -> null
          - uid                   = "4deda798-4f96-4e87-ae77-62317299f207" -> null
        }

      ~ template {
          ~ metadata {
              ~ annotations      = {
                  + "autoscaling.knative.dev/minScale"          = "0"
                  - "client.knative.dev/user-image"             = "docker.io/spellshift/tavern:latest" -> null
                  ~ "run.googleapis.com/client-name"            = "gcloud" -> "terraform"
                  - "run.googleapis.com/client-version"         = "410.0.0" -> null
                  + "run.googleapis.com/container-dependencies" = jsonencode(
                        {
                          + prometheus-sidecar = [
                              + "tavern",
                            ]
                        }
                    )
                  + "run.googleapis.com/sessionAffinity"        = "true"
                    # (2 unchanged elements hidden)
                }
              ~ generation       = 0 -> (known after apply)
              ~ labels           = {
                  - "run.googleapis.com/startupProbeType" = "Default"
                } -> (known after apply)
              ~ name             = "tavern-00001-fej" -> (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              ~ service_account_name  = "3836239296-compute@developer.gserviceaccount.com" -> (known after apply)
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                  ~ image   = "docker.io/spellshift/tavern:latest" -> "spellshift/tavern:latest"
                  + name    = "tavern"

                  - env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  - env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
                  + env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }

                  ~ ports {
                      ~ name           = "http1" -> (known after apply)
                        # (1 unchanged attribute hidden)
                    }

                  - resources {
                      - limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> null
                      - requests = {} -> null
                    }

                  - startup_probe {
                      - failure_threshold     = 1 -> null
                      - initial_delay_seconds = 0 -> null
                      - period_seconds        = 240 -> null
                      - timeout_seconds       = 240 -> null

                      - tcp_socket {
                          - port = 80 -> null
                        }
                    }

                    # (2 unchanged blocks hidden)
                }
              + containers {
                  + image = "us-docker.pkg.dev/cloud-ops-agents-artifacts/cloud-run-gmp-sidecar/cloud-run-gmp-sidecar:1.0.0"
                  + name  = "prometheus-sidecar"
                }
            }
        }

      ~ traffic {
          + url             = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

```